In [151]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [152]:
df_tl = pd.read_csv('test_locations.csv')
df_tc = pd.read_csv('test_customers.csv')

In [153]:
df_tc.shape

(9768, 8)

In [154]:
u_c = df_tc.akeed_customer_id.unique()
df_tc_new = pd.DataFrame(data=u_c, columns=['customer_id'])
df_tc_new.head(5)

  customer_id
0     ICE2DJP
1     FWNUI71
2     LRX7BCH
3     D96DHMD
4     88Q8Y5V

In [155]:
len(df_tc_new.customer_id.unique())

9753

In [156]:
df_tc_new1 = df_tc_new.sort_values(by = ['customer_id'])
df_tc_new1 = df_tc_new1.reset_index(drop = True)
df_tc_new1

     customer_id
0        000IPH5
1        002U0H9
2        00ICGWM
3        015LTZX
4        018O5YY
...          ...
9748     ZZPYP6P
9749     ZZR7XVG
9750     ZZSJX8B
9751     ZZUD9GZ
9752     ZZZW5ZR

[9753 rows x 1 columns]

In [157]:
from sklearn import preprocessing
label_encoder = preprocessing.LabelEncoder()
label_encoder.fit(df_tc_new1.customer_id)
df_tc_label = label_encoder.transform(df_tc_new1.customer_id)
df_tc_label = pd.DataFrame(data=df_tc_label, columns=['label'])
df_tc_label.head(5)

   label
0      0
1      1
2      2
3      3
4      4

In [158]:
df_tc_f = pd.concat([df_tc_new1, df_tc_label], axis = 1)
df_tc_f.head(5)

  customer_id  label
0     000IPH5      0
1     002U0H9      1
2     00ICGWM      2
3     015LTZX      3
4     018O5YY      4

In [159]:
df_tc_dict = df_tc_f.set_index('customer_id')['label'].to_dict()

In [160]:
len(df_tl.customer_id.unique())

10000

In [161]:
df_tl.shape

(16720, 5)

In [162]:
df_tl.isna().sum()

customer_id           0
location_number       0
location_type      7650
latitude              3
longitude             3
dtype: int64

In [163]:
df_tl = df_tl.drop(['location_type'], axis=1)
df_tl.head(5)

  customer_id  location_number    latitude  longitude
0     Z59FTQD                0  126.032278  -9.106019
1     0JP29SK                0    0.278709 -78.623847
2     0JP29SK                1    0.124485 -78.605621
3     0JP29SK                2   -0.113891 -78.577449
4     0JP29SK                3   -0.848796   0.136726

In [164]:
df_tl = df_tl.dropna()
df_tl = df_tl.reset_index(drop=True)

In [165]:
df_tl = df_tl.sort_values(by=['customer_id'])
df_tl = df_tl.reset_index(drop=True)
df_tl.head(5)

  customer_id  location_number   latitude  longitude
0     000IPH5                0  -0.386541 -78.545227
1     002U0H9                0  -1.654883 -78.395332
2     00ICGWM                0  -0.123915  -0.001945
3     00ICGWM                1  -0.021965   0.021158
4     015LTZX                0  19.216488   3.001413

In [172]:
df_tl.isna().sum()

customer_id        0
location_number    0
latitude           0
longitude          0
cl                 0
dtype: int64

In [166]:
str1 = df_tl['location_number'].apply(str)
df_tl['cl'] = df_tl.customer_id + '_' + str1
df_tl.head(5)

  customer_id  location_number   latitude  longitude         cl
0     000IPH5                0  -0.386541 -78.545227  000IPH5_0
1     002U0H9                0  -1.654883 -78.395332  002U0H9_0
2     00ICGWM                0  -0.123915  -0.001945  00ICGWM_0
3     00ICGWM                1  -0.021965   0.021158  00ICGWM_1
4     015LTZX                0  19.216488   3.001413  015LTZX_0

In [167]:
dict_l = df_tl.set_index('cl')['latitude'].to_dict()
dict_lo = df_tl.set_index('cl')['longitude'].to_dict()

In [168]:
sub = pd.read_csv('sub.csv')
sub.head(5)

,CID_X_LOC_NUM_X_VENDOR,target,customer_id,location_number,vendor_id,c_l
0,Z59FTQD X 0 X 243,0,Z59FTQD,0,243,Z59FTQD_0
1,0JP29SK X 0 X 243,0,0JP29SK,0,243,0JP29SK_0
2,0JP29SK X 1 X 243,0,0JP29SK,1,243,0JP29SK_1
3,0JP29SK X 2 X 243,0,0JP29SK,2,243,0JP29SK_2
4,0JP29SK X 3 X 243,0,0JP29SK,3,243,0JP29SK_3

In [169]:
sub['c_latitude'] = sub['c_l'].map(dict_l)
sub['c_longitude'] = sub['c_l'].map(dict_lo)
sub.head(5)

,CID_X_LOC_NUM_X_VENDOR,target,customer_id,location_number,vendor_id,c_l,c_latitude,c_longitude
0,Z59FTQD X 0 X 243,0,Z59FTQD,0,243,Z59FTQD_0,126.032278,-9.106019
1,0JP29SK X 0 X 243,0,0JP29SK,0,243,0JP29SK_0,0.278709,-78.623847
2,0JP29SK X 1 X 243,0,0JP29SK,1,243,0JP29SK_1,0.124485,-78.605621
3,0JP29SK X 2 X 243,0,0JP29SK,2,243,0JP29SK_2,-0.113891,-78.577449
4,0JP29SK X 3 X 243,0,0JP29SK,3,243,0JP29SK_3,-0.848796,0.136726

In [170]:
sub.to_csv('final_sub.csv', index=False)

In [171]:
sub.isna().sum()

CID_X_LOC_NUM_X_VENDOR         0
target                         0
customer_id                46500
location_number             5200
vendor_id                    300
c_l                            0
c_latitude                299500
c_longitude               299500
dtype: int64